// Λύση για το δεύτερο υποπρόβλημα όπου όλα τα μήκη είναι διαφορετικά
// και ελέγχος για το πρώτο υποπρόβλημα όπου n = 2
// Επειδή όλα τα μήκη είναι διαφορετικά, κάθε μέρα κόβουμε
// ακριβώς ένα μπαμπού, οπότε ο αριθμός των ημερών είναι
// ίσος με τον αριθμό των μπαμπού.

#include <cstdio>

const size_t MAXN = 200'000;

using namespace std;

long n;
long lengths[MAXN];

int main() {
  scanf("%ld", &n);
  for (long i = 0; i < n; i++) {
    scanf("%ld", &lengths[i]);
  }

  // Για να μην χάσουμε το πρώτο υποπρόβλημα, ελέγχουμε αν n είναι 2
  if (n == 2) {
    // Αν είναι ίσα τα μήκη, χρειαζόμαστε 1 μέρα, αλλιώς 2 μέρες
    if (lengths[0] == lengths[1]) {
      printf("1\n");
    } else {
      printf("2\n");
    }
    return 0;
  }

  // Αφού τα μήκη είναι παντα διαφορετικά στο δεύτερο υποπρόβλημα,
  // η απάντηση είναι n
  printf("%ld\n", n);
}
