// Λύση για το πρώτο υποπρόβλημα όπου n = 2
// Επειδή υπάρχουν μόνο δύο μπαμπού, απλά ελέγχουμε αν είναι ίσα, οπότε
// χρειαζόμαστε μία μέρα, αλλιώς είναι διαφορετικά και χρειαζόμαστε δύο μέρες.

#include <cstdio>

const size_t MAXN = 200'000;

using namespace std;

long n;
long lengths[MAXN];

int main() {
  // Διαβάζουμε το N παρ' ότι ξέρουμε ότι σε αυτό το υποπρόβλημα είναι πάντα 2
  scanf("%ld", &n);
  for (long i = 0; i < n; i++) {
    scanf("%ld", &lengths[i]);
  }

  // Αν είναι ίσα τα μήκη, χρειαζόμαστε 1 μέρα, αλλιώς 2 μέρες
  if (lengths[0] == lengths[1]) {
    printf("1\n");
  } else {
    printf("2\n");
  }
}
